app/Http/Controllers/Admin/Tour/TourController.php

    public function index(NameFilters $filters)
    {
        $this->authorize('tours.tours.index');
        $tours = Tour::query()
            ->filters($filters)
            ->orderBy('name','asc')
            ->paginate(20);
---
select * from `tours` order by `id` desc, `name` asc limit 20 offset 0
select count(*) as aggregate from `tours`