app/Group.php

    public function getAll()
    {
        return (new static)->get();
---
select * from `groups`