app/Support/Repositories/TourCategoryRepository.php

select * from `groups` where (`name_link` = 'vietnam') limit 1
---
    public function getViaSlug($slug, $onlyPublished = false)
    {
        $group = $this->group->where([
            ['name_link', '=', $slug]
        ]);