app/Support/Option/Option.php

select * from `options` where `autoload` = '1'
---
    private function getOptionsAutoload()
    {
        $records = $this->optionModel->where('autoload', true)->get();

select * from `options` where `name` = 'site_name' limit 1
---
    private function getOptionNotInAutoload($name, $default)
    {
        $option = $this->optionModel->where('name', $name)->first();