app/Providers/AppServiceProvider.php

    public function register()
    {
        $this->app->singleton('option', \App\Support\Option\Option::class);

        view()->composer('*', function ($view) {
            $key = 'popup.list_country';
            if (! \Cache::has($key)) {
                $data = Country::all()->mapWithKeys(function($query){
                    return [
                        $query->location => $query->location,
                    ];
                });
---
select * from `country`